In [7]:
import pandas as pd

In [10]:
data = pd.read_csv("quikr_Car.csv")
data.head()

,name,company,year,Price,kms_driven,fuel_type
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007,"80,000","45,000 kms",Petrol
1,Mahindra Jeep CL550 MDI,Mahindra,2006,"4,25,000",40 kms,Diesel
2,Maruti Suzuki Alto 800 Vxi,Maruti,2018,Ask For Price,"22,000 kms",Petrol
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,"3,25,000","28,000 kms",Petrol
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014,"5,75,000","36,000 kms",Diesel

In [14]:
data.shape

(892, 6)

data.info()

In [78]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 0 entries
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        0 non-null      object
 1   company     0 non-null      object
 2   year        0 non-null      int32
 3   Price       0 non-null      object
 4   kms_driven  0 non-null      object
 5   fuel_type   0 non-null      object
dtypes: int32(1), object(5)
memory usage: 0.0+ bytes

# change 
year filter and change type
price filter and change type
kms_filter and change type

In [81]:
data["year"] = data["year"].astype(int)
data.head()

Empty DataFrame
Columns: [name, company, year, Price, kms_driven, fuel_type]
Index: []

In [77]:
data['Price'].unique

Empty DataFrame
Columns: [name, company, year, Price, kms_driven, fuel_type]
Index: []